stm32duino/ISM330IS/src/ism330is_reg.h
typedef union {
  ism330is_func_cfg_access_t    func_cfg_access;
  ism330is_pin_ctrl_t    pin_ctrl;
  ism330is_drdy_pulsed_reg_t    drdy_pulsed_reg;
  ism330is_int1_ctrl_t    int1_ctrl;
  ism330is_int2_ctrl_t    int2_ctrl;
  ism330is_who_am_i_t    who_am_i;
  ism330is_ctrl1_xl_t    ctrl1_xl;
  ism330is_ctrl2_g_t    ctrl2_g;
  ism330is_ctrl3_c_t    ctrl3_c;
  ism330is_ctrl4_c_t    ctrl4_c;
  ism330is_ctrl5_c_t    ctrl5_c;
  ism330is_ctrl6_c_t    ctrl6_c;
  ism330is_ctrl7_g_t    ctrl7_g;
  ism330is_ctrl9_c_t    ctrl9_c;
  ism330is_ctrl10_c_t    ctrl10_c;
  ism330is_ispu_int_status0_mainpage_t    ispu_int_status0_mainpage;
  ism330is_ispu_int_status1_mainpage_t    ispu_int_status1_mainpage;
  ism330is_ispu_int_status2_mainpage_t    ispu_int_status2_mainpage;
  ism330is_ispu_int_status3_mainpage_t    ispu_int_status3_mainpage;
  ism330is_status_reg_t    status_reg;
  ism330is_out_temp_l_t    out_temp_l;
  ism330is_out_temp_h_t    out_temp_h;
  ism330is_outx_l_g_t    outx_l_g;
  ism330is_outx_h_g_t    outx_h_g;
  ism330is_outy_l_g_t    outy_l_g;
  ism330is_outy_h_g_t    outy_h_g;
  ism330is_outz_l_g_t    outz_l_g;
  ism330is_outz_h_g_t    outz_h_g;
  ism330is_outx_l_a_t    outx_l_a;
  ism330is_outx_h_a_t    outx_h_a;
  ism330is_outy_l_a_t    outy_l_a;
  ism330is_outy_h_a_t    outy_h_a;
  ism330is_outz_l_a_t    outz_l_a;
  ism330is_outz_h_a_t    outz_h_a;
  ism330is_status_master_mainpage_t    status_master_mainpage;
  ism330is_timestamp0_t    timestamp0;
  ism330is_timestamp1_t    timestamp1;
  ism330is_timestamp2_t    timestamp2;
  ism330is_timestamp3_t    timestamp3;
  ism330is_md1_cfg_t    md1_cfg;
  ism330is_md2_cfg_t    md2_cfg;
  ism330is_internal_freq_fine_t            internal_freq_fine;
  ism330is_ispu_dummy_cfg_1_l_t    ispu_dummy_cfg_1_l;
  ism330is_ispu_dummy_cfg_1_h_t    ispu_dummy_cfg_1_h;
  ism330is_ispu_dummy_cfg_2_l_t    ispu_dummy_cfg_2_l;
  ism330is_ispu_dummy_cfg_2_h_t    ispu_dummy_cfg_2_h;
  ism330is_ispu_dummy_cfg_3_l_t    ispu_dummy_cfg_3_l;
  ism330is_ispu_dummy_cfg_3_h_t    ispu_dummy_cfg_3_h;
  ism330is_ispu_dummy_cfg_4_l_t    ispu_dummy_cfg_4_l;
  ism330is_ispu_dummy_cfg_4_h_t    ispu_dummy_cfg_4_h;
  ism330is_sensor_hub_1_t    sensor_hub_1;
  ism330is_sensor_hub_2_t    sensor_hub_2;
  ism330is_sensor_hub_3_t    sensor_hub_3;
  ism330is_sensor_hub_4_t    sensor_hub_4;
  ism330is_sensor_hub_5_t    sensor_hub_5;
  ism330is_sensor_hub_6_t    sensor_hub_6;
  ism330is_sensor_hub_7_t    sensor_hub_7;
  ism330is_sensor_hub_8_t    sensor_hub_8;
  ism330is_sensor_hub_9_t    sensor_hub_9;
  ism330is_sensor_hub_10_t    sensor_hub_10;
  ism330is_sensor_hub_11_t    sensor_hub_11;
  ism330is_sensor_hub_12_t    sensor_hub_12;
  ism330is_sensor_hub_13_t    sensor_hub_13;
  ism330is_sensor_hub_14_t    sensor_hub_14;
  ism330is_sensor_hub_15_t    sensor_hub_15;
  ism330is_sensor_hub_16_t    sensor_hub_16;
  ism330is_sensor_hub_17_t    sensor_hub_17;
  ism330is_sensor_hub_18_t    sensor_hub_18;
  ism330is_master_config_t    master_config;
  ism330is_slv0_add_t    slv0_add;
  ism330is_slv0_subadd_t    slv0_subadd;
  ism330is_slv0_config_t    slv0_config;
  ism330is_slv1_add_t    slv1_add;
  ism330is_slv1_subadd_t    slv1_subadd;
  ism330is_slv1_config_t    slv1_config;
  ism330is_slv2_add_t    slv2_add;
  ism330is_slv2_subadd_t    slv2_subadd;
  ism330is_slv2_config_t    slv2_config;
  ism330is_slv3_add_t    slv3_add;
  ism330is_slv3_subadd_t    slv3_subadd;
  ism330is_slv3_config_t    slv3_config;
  ism330is_datawrite_slv0_t    datawrite_slv0;
  ism330is_status_master_t    status_master;
  ism330is_ispu_config_t    ispu_config;
  ism330is_ispu_status_t    ispu_status;
  ism330is_ispu_mem_sel_t    ispu_mem_sel;
  ism330is_ispu_mem_addr1_t    ispu_mem_addr1;
  ism330is_ispu_mem_addr0_t    ispu_mem_addr0;
  ism330is_ispu_mem_data_t    ispu_mem_data;
  ism330is_ispu_if2s_flag_l_t    ispu_if2s_flag_l;
  ism330is_ispu_if2s_flag_h_t    ispu_if2s_flag_h;
  ism330is_ispu_s2if_flag_l_t    ispu_s2if_flag_l;
  ism330is_ispu_s2if_flag_h_t    ispu_s2if_flag_h;
  ism330is_ispu_dout_00_l_t    ispu_dout_00_l;
  ism330is_ispu_dout_00_h_t    ispu_dout_00_h;
  ism330is_ispu_dout_01_l_t    ispu_dout_01_l;
  ism330is_ispu_dout_01_h_t    ispu_dout_01_h;
  ism330is_ispu_dout_02_l_t    ispu_dout_02_l;
  ism330is_ispu_dout_02_h_t    ispu_dout_02_h;
  ism330is_ispu_dout_03_l_t    ispu_dout_03_l;
  ism330is_ispu_dout_03_h_t    ispu_dout_03_h;
  ism330is_ispu_dout_04_l_t    ispu_dout_04_l;
  ism330is_ispu_dout_04_h_t    ispu_dout_04_h;
  ism330is_ispu_dout_05_l_t    ispu_dout_05_l;
  ism330is_ispu_dout_05_h_t    ispu_dout_05_h;
  ism330is_ispu_dout_06_l_t    ispu_dout_06_l;
  ism330is_ispu_dout_06_h_t    ispu_dout_06_h;
  ism330is_ispu_dout_07_l_t    ispu_dout_07_l;
  ism330is_ispu_dout_07_h_t    ispu_dout_07_h;
  ism330is_ispu_dout_08_l_t    ispu_dout_08_l;
  ism330is_ispu_dout_08_h_t    ispu_dout_08_h;
  ism330is_ispu_dout_09_l_t    ispu_dout_09_l;
  ism330is_ispu_dout_09_h_t    ispu_dout_09_h;
  ism330is_ispu_dout_10_l_t    ispu_dout_10_l;
  ism330is_ispu_dout_10_h_t    ispu_dout_10_h;
  ism330is_ispu_dout_11_l_t    ispu_dout_11_l;
  ism330is_ispu_dout_11_h_t    ispu_dout_11_h;
  ism330is_ispu_dout_12_l_t    ispu_dout_12_l;
  ism330is_ispu_dout_12_h_t    ispu_dout_12_h;
  ism330is_ispu_dout_13_l_t    ispu_dout_13_l;
  ism330is_ispu_dout_13_h_t    ispu_dout_13_h;
  ism330is_ispu_dout_14_l_t    ispu_dout_14_l;
  ism330is_ispu_dout_14_h_t    ispu_dout_14_h;
  ism330is_ispu_dout_15_l_t    ispu_dout_15_l;
  ism330is_ispu_dout_15_h_t    ispu_dout_15_h;
  ism330is_ispu_dout_16_l_t    ispu_dout_16_l;
  ism330is_ispu_dout_16_h_t    ispu_dout_16_h;
  ism330is_ispu_dout_17_l_t    ispu_dout_17_l;
  ism330is_ispu_dout_17_h_t    ispu_dout_17_h;
  ism330is_ispu_dout_18_l_t    ispu_dout_18_l;
  ism330is_ispu_dout_18_h_t    ispu_dout_18_h;
  ism330is_ispu_dout_19_l_t    ispu_dout_19_l;
  ism330is_ispu_dout_19_h_t    ispu_dout_19_h;
  ism330is_ispu_dout_20_l_t    ispu_dout_20_l;
  ism330is_ispu_dout_20_h_t    ispu_dout_20_h;
  ism330is_ispu_dout_21_l_t    ispu_dout_21_l;
  ism330is_ispu_dout_21_h_t    ispu_dout_21_h;
  ism330is_ispu_dout_22_l_t    ispu_dout_22_l;
  ism330is_ispu_dout_22_h_t    ispu_dout_22_h;
  ism330is_ispu_dout_23_l_t    ispu_dout_23_l;
  ism330is_ispu_dout_23_h_t    ispu_dout_23_h;
  ism330is_ispu_dout_24_l_t    ispu_dout_24_l;
  ism330is_ispu_dout_24_h_t    ispu_dout_24_h;
  ism330is_ispu_dout_25_l_t    ispu_dout_25_l;
  ism330is_ispu_dout_25_h_t    ispu_dout_25_h;
  ism330is_ispu_dout_26_l_t    ispu_dout_26_l;
  ism330is_ispu_dout_26_h_t    ispu_dout_26_h;
  ism330is_ispu_dout_27_l_t    ispu_dout_27_l;
  ism330is_ispu_dout_27_h_t    ispu_dout_27_h;
  ism330is_ispu_dout_28_l_t    ispu_dout_28_l;
  ism330is_ispu_dout_28_h_t    ispu_dout_28_h;
  ism330is_ispu_dout_29_l_t    ispu_dout_29_l;
  ism330is_ispu_dout_29_h_t    ispu_dout_29_h;
  ism330is_ispu_dout_30_l_t    ispu_dout_30_l;
  ism330is_ispu_dout_30_h_t    ispu_dout_30_h;
  ism330is_ispu_dout_31_l_t    ispu_dout_31_l;
  ism330is_ispu_dout_31_h_t    ispu_dout_31_h;
  ism330is_ispu_int1_ctrl0_t    ispu_int1_ctrl0;
  ism330is_ispu_int1_ctrl1_t    ispu_int1_ctrl1;
  ism330is_ispu_int1_ctrl2_t    ispu_int1_ctrl2;
  ism330is_ispu_int1_ctrl3_t    ispu_int1_ctrl3;
  ism330is_ispu_int2_ctrl0_t    ispu_int2_ctrl0;
  ism330is_ispu_int2_ctrl1_t    ispu_int2_ctrl1;
  ism330is_ispu_int2_ctrl2_t    ispu_int2_ctrl2;
  ism330is_ispu_int2_ctrl3_t    ispu_int2_ctrl3;
  ism330is_ispu_int_status0_t    ispu_int_status0;
  ism330is_ispu_int_status1_t    ispu_int_status1;
  ism330is_ispu_int_status2_t    ispu_int_status2;
  ism330is_ispu_int_status3_t    ispu_int_status3;
  ism330is_ispu_algo0_t    ispu_algo0;
  ism330is_ispu_algo1_t    ispu_algo1;
  ism330is_ispu_algo2_t    ispu_algo2;
  ism330is_ispu_algo3_t    ispu_algo3;
  bitwise_t    bitwise;
  uint8_t    byte;
} ism330is_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

