stm32duino/ISM330IS/src/ism330is_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t ism330is_read_reg(const ism330is_ctx_t *ctx, uint8_t reg,
                          uint8_t *data,
                          uint16_t len);
int32_t ism330is_write_reg(const ism330is_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);

float_t ism330is_from_fs2g_to_mg(int16_t lsb);
float_t ism330is_from_fs4g_to_mg(int16_t lsb);
float_t ism330is_from_fs8g_to_mg(int16_t lsb);
float_t ism330is_from_fs16g_to_mg(int16_t lsb);

float_t ism330is_from_fs125dps_to_mdps(int16_t lsb);
float_t ism330is_from_fs250dps_to_mdps(int16_t lsb);
float_t ism330is_from_fs500dps_to_mdps(int16_t lsb);
float_t ism330is_from_fs1000dps_to_mdps(int16_t lsb);
float_t ism330is_from_fs2000dps_to_mdps(int16_t lsb);

float_t ism330is_from_lsb_to_celsius(int16_t lsb);

typedef enum {
  ISM330IS_MAIN_MEM_BANK =             0x0,
  ISM330IS_SENSOR_HUB_MEM_BANK =       0x2,
  ISM330IS_ISPU_MEM_BANK =             0x3,
} ism330is_mem_bank_t;
int32_t ism330is_mem_bank_set(const ism330is_ctx_t *ctx, ism330is_mem_bank_t val);
int32_t ism330is_mem_bank_get(const ism330is_ctx_t *ctx, ism330is_mem_bank_t *val);

typedef enum {
  ISM330IS_DRDY_LATCHED =              0x0,
  ISM330IS_DRDY_PULSED =               0x1,
} ism330is_data_ready_mode_t;
int32_t ism330is_data_ready_mode_set(const ism330is_ctx_t *ctx,
                                     ism330is_data_ready_mode_t val);
int32_t ism330is_data_ready_mode_get(const ism330is_ctx_t *ctx,
                                     ism330is_data_ready_mode_t *val);

int32_t ism330is_device_id_set(const ism330is_ctx_t *ctx, uint8_t val);
int32_t ism330is_device_id_get(const ism330is_ctx_t *ctx, uint8_t *val);

int32_t ism330is_software_reset(const ism330is_ctx_t *ctx);

int32_t ism330is_boot_set(const ism330is_ctx_t *ctx, uint8_t val);
int32_t ism330is_boot_get(const ism330is_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330IS_HIGH_PERFOMANCE_MODE_ENABLED =        0x0,
  ISM330IS_HIGH_PERFOMANCE_MODE_DISABLED =       0x1,
} ism330is_hm_mode_t;
int32_t ism330is_xl_hm_mode_set(const ism330is_ctx_t *ctx, ism330is_hm_mode_t val);
int32_t ism330is_xl_hm_mode_get(const ism330is_ctx_t *ctx, ism330is_hm_mode_t *val);
int32_t ism330is_gy_hm_mode_set(const ism330is_ctx_t *ctx, ism330is_hm_mode_t val);
int32_t ism330is_gy_hm_mode_get(const ism330is_ctx_t *ctx, ism330is_hm_mode_t *val);

typedef enum {
  ISM330IS_2g =                        0x0,
  ISM330IS_16g =                       0x1,
  ISM330IS_4g =                        0x2,
  ISM330IS_8g =                        0x3,
} ism330is_xl_full_scale_t;
int32_t ism330is_xl_full_scale_set(const ism330is_ctx_t *ctx,
                                   ism330is_xl_full_scale_t val);
int32_t ism330is_xl_full_scale_get(const ism330is_ctx_t *ctx,
                                   ism330is_xl_full_scale_t *val);

typedef enum {
  ISM330IS_XL_ODR_OFF =                0x0,
  ISM330IS_XL_ODR_AT_12Hz5_HP =        0x1,
  ISM330IS_XL_ODR_AT_26H_HP =          0x2,
  ISM330IS_XL_ODR_AT_52Hz_HP =         0x3,
  ISM330IS_XL_ODR_AT_104Hz_HP =        0x4,
  ISM330IS_XL_ODR_AT_208Hz_HP =        0x5,
  ISM330IS_XL_ODR_AT_416Hz_HP =        0x6,
  ISM330IS_XL_ODR_AT_833Hz_HP =        0x7,
  ISM330IS_XL_ODR_AT_1667Hz_HP =       0x8,
  ISM330IS_XL_ODR_AT_3333Hz_HP =       0x9,
  ISM330IS_XL_ODR_AT_6667Hz_HP =       0xa,
  ISM330IS_XL_ODR_AT_12Hz5_LP =        0x11,
  ISM330IS_XL_ODR_AT_26H_LP =          0x12,
  ISM330IS_XL_ODR_AT_52Hz_LP =         0x13,
  ISM330IS_XL_ODR_AT_104Hz_LP =        0x14,
  ISM330IS_XL_ODR_AT_208Hz_LP =        0x15,
  ISM330IS_XL_ODR_AT_416Hz_LP =        0x16,
  ISM330IS_XL_ODR_AT_833Hz_LP =        0x17,
  ISM330IS_XL_ODR_AT_1667Hz_LP =       0x18,
  ISM330IS_XL_ODR_AT_3333Hz_LP =       0x19,
  ISM330IS_XL_ODR_AT_6667Hz_LP =       0x1a,
  ISM330IS_XL_ODR_AT_1Hz6_LP =         0x1b,
} ism330is_xl_data_rate_t;
int32_t ism330is_xl_data_rate_set(const ism330is_ctx_t *ctx,
                                  ism330is_xl_data_rate_t val);
int32_t ism330is_xl_data_rate_get(const ism330is_ctx_t *ctx,
                                  ism330is_xl_data_rate_t *val);

typedef enum {
  ISM330IS_250dps =                    0x0,
  ISM330IS_500dps =                    0x1,
  ISM330IS_1000dps =                   0x2,
  ISM330IS_2000dps =                   0x3,
  ISM330IS_125dps =                    0x10,
} ism330is_gy_full_scale_t;
int32_t ism330is_gy_full_scale_set(const ism330is_ctx_t *ctx,
                                   ism330is_gy_full_scale_t val);
int32_t ism330is_gy_full_scale_get(const ism330is_ctx_t *ctx,
                                   ism330is_gy_full_scale_t *val);

typedef enum {
  ISM330IS_GY_ODR_OFF =                0x0,
  ISM330IS_GY_ODR_AT_12Hz5_HP =        0x1,
  ISM330IS_GY_ODR_AT_26H_HP =          0x2,
  ISM330IS_GY_ODR_AT_52Hz_HP =         0x3,
  ISM330IS_GY_ODR_AT_104Hz_HP =        0x4,
  ISM330IS_GY_ODR_AT_208Hz_HP =        0x5,
  ISM330IS_GY_ODR_AT_416Hz_HP =        0x6,
  ISM330IS_GY_ODR_AT_833Hz_HP =        0x7,
  ISM330IS_GY_ODR_AT_1667Hz_HP =       0x8,
  ISM330IS_GY_ODR_AT_3333Hz_HP =       0x9,
  ISM330IS_GY_ODR_AT_6667Hz_HP =       0xa,
  ISM330IS_GY_ODR_AT_12Hz5_LP =        0x11,
  ISM330IS_GY_ODR_AT_26H_LP =          0x12,
  ISM330IS_GY_ODR_AT_52Hz_LP =         0x13,
  ISM330IS_GY_ODR_AT_104Hz_LP =        0x14,
  ISM330IS_GY_ODR_AT_208Hz_LP =        0x15,
  ISM330IS_GY_ODR_AT_416Hz_LP =        0x16,
  ISM330IS_GY_ODR_AT_833Hz_LP =        0x17,
  ISM330IS_GY_ODR_AT_1667Hz_LP =       0x18,
  ISM330IS_GY_ODR_AT_3333Hz_LP =       0x19,
  ISM330IS_GY_ODR_AT_6667Hz_LP =       0x1a,
} ism330is_gy_data_rate_t;
int32_t ism330is_gy_data_rate_set(const ism330is_ctx_t *ctx,
                                  ism330is_gy_data_rate_t val);
int32_t ism330is_gy_data_rate_get(const ism330is_ctx_t *ctx,
                                  ism330is_gy_data_rate_t *val);

