stm32duino/ISM330IS/src/ism330is_reg.h
int32_t ism330is_sh_slave_connected_set(const ism330is_ctx_t *ctx,
                                        ism330is_sh_slave_connected_t val);
int32_t ism330is_sh_slave_connected_get(const ism330is_ctx_t *ctx,
                                        ism330is_sh_slave_connected_t *val);

int32_t ism330is_sh_master_set(const ism330is_ctx_t *ctx, uint8_t val);
int32_t ism330is_sh_master_get(const ism330is_ctx_t *ctx, uint8_t *val);

int32_t ism330is_sh_master_interface_pull_up_set(const ism330is_ctx_t *ctx,
                                                 uint8_t val);
int32_t ism330is_sh_master_interface_pull_up_get(const ism330is_ctx_t *ctx,
                                                 uint8_t *val);

int32_t ism330is_sh_pass_through_set(const ism330is_ctx_t *ctx, uint8_t val);
int32_t ism330is_sh_pass_through_get(const ism330is_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330IS_SH_TRG_XL_GY_DRDY =         0x0,
  ISM330IS_SH_TRIG_INT2 =              0x1,
} ism330is_sh_syncro_mode_t;
int32_t ism330is_sh_syncro_mode_set(const ism330is_ctx_t *ctx,
                                    ism330is_sh_syncro_mode_t val);
int32_t ism330is_sh_syncro_mode_get(const ism330is_ctx_t *ctx,
                                    ism330is_sh_syncro_mode_t *val);

typedef enum {
  ISM330IS_EACH_SH_CYCLE =             0x0,
  ISM330IS_ONLY_FIRST_CYCLE =          0x1,
} ism330is_sh_write_mode_t;
int32_t ism330is_sh_write_mode_set(const ism330is_ctx_t *ctx,
                                   ism330is_sh_write_mode_t val);
int32_t ism330is_sh_write_mode_get(const ism330is_ctx_t *ctx,
                                   ism330is_sh_write_mode_t *val);

int32_t ism330is_sh_reset_set(const ism330is_ctx_t *ctx, uint8_t val);
int32_t ism330is_sh_reset_get(const ism330is_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} ism330is_sh_cfg_write_t;
int32_t ism330is_sh_cfg_write(const ism330is_ctx_t *ctx,
                              ism330is_sh_cfg_write_t *val);
typedef enum {
  ISM330IS_SH_104Hz =                  0x0,
  ISM330IS_SH_52Hz =                   0x1,
  ISM330IS_SH_26Hz =                   0x2,
  ISM330IS_SH_12_5Hz =                 0x3,
} ism330is_sh_data_rate_t;
int32_t ism330is_sh_data_rate_set(const ism330is_ctx_t *ctx,
                                  ism330is_sh_data_rate_t val);
int32_t ism330is_sh_data_rate_get(const ism330is_ctx_t *ctx,
                                  ism330is_sh_data_rate_t *val);

typedef struct {
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} ism330is_sh_cfg_read_t;
int32_t ism330is_sh_slv_cfg_read(const ism330is_ctx_t *ctx, uint8_t idx,
                                 ism330is_sh_cfg_read_t *val);

int32_t ism330is_sh_status_get(const ism330is_ctx_t *ctx,
                               ism330is_status_master_t *val);

int32_t ism330is_ispu_reset_set(const ism330is_ctx_t *ctx, uint8_t val);
int32_t ism330is_ispu_reset_get(const ism330is_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330IS_ISPU_CLK_5MHz =             0x0,
  ISM330IS_ISPU_CLK_10MHz =            0x1,
} ism330is_ispu_clock_sel_t;
int32_t ism330is_ispu_clock_set(const ism330is_ctx_t *ctx,
                                ism330is_ispu_clock_sel_t val);
int32_t ism330is_ispu_clock_get(const ism330is_ctx_t *ctx,
                                ism330is_ispu_clock_sel_t *val);

typedef enum {
  ISM330IS_ISPU_ODR_OFF =              0x0,
  ISM330IS_ISPU_ODR_AT_12Hz5 =         0x1,
  ISM330IS_ISPU_ODR_AT_26Hz =          0x2,
  ISM330IS_ISPU_ODR_AT_52Hz =          0x3,
  ISM330IS_ISPU_ODR_AT_104Hz =         0x4,
  ISM330IS_ISPU_ODR_AT_208Hz =         0x5,
  ISM330IS_ISPU_ODR_AT_416Hz =         0x6,
  ISM330IS_ISPU_ODR_AT_833Hz =         0x7,
  ISM330IS_ISPU_ODR_AT_1667Hz =        0x8,
  ISM330IS_ISPU_ODR_AT_3333Hz =        0x9,
  ISM330IS_ISPU_ODR_AT_6667Hz =        0xa,
} ism330is_ispu_data_rate_t;
int32_t ism330is_ispu_data_rate_set(const ism330is_ctx_t *ctx,
                                    ism330is_ispu_data_rate_t val);
int32_t ism330is_ispu_data_rate_get(const ism330is_ctx_t *ctx,
                                    ism330is_ispu_data_rate_t *val);

typedef enum {
  ISM330IS_ISPU_BDU_OFF =              0x0,
  ISM330IS_ISPU_BDU_ON_2B_4B =         0x1,
  ISM330IS_ISPU_BDU_ON_2B_2B =         0x2,
  ISM330IS_ISPU_BDU_ON_4B_4B =         0x3,
} ism330is_ispu_bdu_t;
int32_t ism330is_ispu_bdu_set(const ism330is_ctx_t *ctx, ism330is_ispu_bdu_t val);
int32_t ism330is_ispu_bdu_get(const ism330is_ctx_t *ctx, ism330is_ispu_bdu_t *val);

int32_t ism330is_ia_ispu_get(const ism330is_ctx_t *ctx, uint32_t *val);

int32_t ism330is_ispu_write_dummy_cfg(const ism330is_ctx_t *ctx, uint8_t offset,
                                      uint8_t *val, uint8_t len);
int32_t ism330is_ispu_read_dummy_cfg(const ism330is_ctx_t *ctx, uint8_t offset,
                                     uint8_t *val, uint8_t len);

typedef enum {
  ISM330IS_ISPU_TURN_ON =              0x0,
  ISM330IS_ISPU_TURN_OFF =             0x1,
} ism330is_ispu_boot_latched_t;
int32_t ism330is_ispu_boot_set(const ism330is_ctx_t *ctx,
                               ism330is_ispu_boot_latched_t val);
int32_t ism330is_ispu_boot_get(const ism330is_ctx_t *ctx,
                               ism330is_ispu_boot_latched_t *val);

typedef enum {
  ISM330IS_ISPU_INT_PULSED =           0x0,
  ISM330IS_ISPU_INT_LATCHED =          0x1,
} ism330is_ispu_int_latched_t;
int32_t ism330is_ispu_int_latched_set(const ism330is_ctx_t *ctx,
                                      ism330is_ispu_int_latched_t val);
int32_t ism330is_ispu_int_latched_get(const ism330is_ctx_t *ctx,
                                      ism330is_ispu_int_latched_t *val);

typedef enum {
  ISM330IS_ISPU_BOOT_IN_PROGRESS =     0x0,
  ISM330IS_ISPU_BOOT_ENDED =           0x1,
} ism330is_ispu_boot_end_t;
int32_t ism330is_ispu_get_boot_status(const ism330is_ctx_t *ctx,
                                      ism330is_ispu_boot_end_t *val);

