stm32duino/ISM330IS/src/ism330is_reg.h
typedef enum {
  ISM330IS_ISPU_DATA_RAM_MEMORY =      0x0,
  ISM330IS_ISPU_PROGRAM_RAM_MEMORY =   0x1,
} ism330is_ispu_memory_type_t;
int32_t ism330is_ispu_read_memory_enable(const ism330is_ctx_t *ctx,
                                         ism330is_ispu_memory_type_t val);
int32_t ism330is_ispu_read_memory_disable(const ism330is_ctx_t *ctx);

int32_t ism330is_ispu_write_memory(const ism330is_ctx_t *ctx,
                                   ism330is_ispu_memory_type_t mem_sel,
                                   uint16_t mem_addr, uint8_t *mem_data, uint16_t len);
int32_t ism330is_ispu_read_memory(const ism330is_ctx_t *ctx,
                                  ism330is_ispu_memory_type_t mem_sel,
                                  uint16_t mem_addr, uint8_t *mem_data, uint16_t len);

int32_t ism330is_ispu_write_flags(const ism330is_ctx_t *ctx, uint16_t data);
int32_t ism330is_ispu_read_flags(const ism330is_ctx_t *ctx, uint16_t *data);
int32_t ism330is_ispu_clear_flags(const ism330is_ctx_t *ctx);

int32_t ism330is_ispu_read_data_raw_get(const ism330is_ctx_t *ctx,
                                        uint8_t *val,
                                        uint8_t len);

int32_t ism330is_ispu_int1_ctrl_get(const ism330is_ctx_t *ctx, uint32_t *val);
int32_t ism330is_ispu_int1_ctrl_set(const ism330is_ctx_t *ctx, uint32_t val);
int32_t ism330is_ispu_int2_ctrl_get(const ism330is_ctx_t *ctx, uint32_t *val);
int32_t ism330is_ispu_int2_ctrl_set(const ism330is_ctx_t *ctx, uint32_t val);

int32_t ism330is_ispu_int_status_get(const ism330is_ctx_t *ctx, uint32_t *val);

int32_t ism330is_ispu_algo_get(const ism330is_ctx_t *ctx, uint32_t *val);
int32_t ism330is_ispu_algo_set(const ism330is_ctx_t *ctx, uint32_t val);
/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*ISM330IS_DRIVER_H */
